c5/src/Documents/Hiring/Hiring.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Hiring</name>
  <registerRecords>InformationRegister.Employees</registerRecords>
  <registerRecords>InformationRegister.Personnel</registerRecords>
  <registerRecords>InformationRegister.Employment</registerRecords>
  <registerRecords>InformationRegister.EmployeeRates</registerRecords>
  <registerRecords>InformationRegister.SalaryInHand</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Additions</name>
    <attributes>
      <name>Compensation</name>
      <type>
        <types>ChartOfCalculationTypesRef.Compensations</types>
      </type>
    </attributes>
    <attributes>
      <name>Currency</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>Employee</name>
      <type>
        <types>CatalogRef.Employees</types>
      </type>
    </attributes>
    <attributes>
      <name>Rate</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Employees</name>
    <attributes>
      <name>Compensation</name>
      <type>
        <types>ChartOfCalculationTypesRef.Compensations</types>
      </type>
    </attributes>
    <attributes>
      <name>Currency</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>DateEnd</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DateStart</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Department</name>
      <type>
        <types>CatalogRef.Departments</types>
      </type>
    </attributes>
    <attributes>
      <name>Duration</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Employee</name>
      <type>
        <types>CatalogRef.Employees</types>
      </type>
    </attributes>
    <attributes>
      <name>Employment</name>
      <type>
        <types>EnumRef.Employment</types>
      </type>
    </attributes>
    <attributes>
      <name>Expenses</name>
      <type>
        <types>CatalogRef.ExpenseMethods</types>
      </type>
    </attributes>
    <attributes>
      <name>Individual</name>
      <type>
        <types>CatalogRef.Individuals</types>
      </type>
    </attributes>
    <attributes>
      <name>InHand</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Position</name>
      <type>
        <types>CatalogRef.Positions</types>
      </type>
    </attributes>
    <attributes>
      <name>Rate</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Schedule</name>
      <type>
        <types>CatalogRef.Schedules</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

c5/src/Documents/Hiring/Forms/Row/Module.bsl
&AtClient
var TableRow export;
&AtClient
var AdditionsRow;

// *****************************************
// *********** Form events

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	init ();
	loadParams ();
	Options.Company ( ThisObject, Object.Company );
	
EndProcedure

&AtServer
Procedure init ()
	
	Currency = Application.Currency ();
	if ( Parameters.row ) then
		Schedule = Application.Schedule ();
	endif;

EndProcedure 

&AtServer
Procedure loadParams ()
	
	Object.Company = Parameters.Company;
	
EndProcedure 

&AtClient
Procedure OnOpen ( Cancel )
	
	loadData ();
	
EndProcedure

&AtClient
Procedure loadData ()
	
	owner = FormOwner.Object;
	Object.Date = owner.Date;
	TableRow = Object.Employees.Add ();
	FillPropertyValues ( TableRow, FormOwner.Items.Employees.CurrentData );
	if ( Parameters.row ) then
		TableRow.DateStart = Object.Date;
		TableRow.Schedule = Schedule;
		TableRow.Currency = Currency;
		TableRow.Employment = PredefinedValue ( "Enum.Employment.Main" );
	else
		table = Object.Additions;
		rows = owner.Additions.FindRows ( new Structure ( "Employee", TableRow.Employee ) );
		for each row in rows do
			newRow = table.Add ();
			FillPropertyValues ( newRow, row );
		enddo; 
	endif; 
	
EndProcedure 

// *****************************************
// *********** Group Form

&AtClient
Procedure OK ( Command )
	
	HiringRowForm.OK ( ThisObject );
	
EndProcedure

&AtClient
Procedure EmployeeOnChange ( Item )
	
	HiringForm.SetIndividual ( TableRow );
	
EndProcedure

&AtClient
Procedure DateStartOnChange ( Item )
	
	сalcDateEnd ();
	
EndProcedure

&AtClient
Procedure сalcDateEnd ()
	
	start = TableRow.DateStart;
	duration = TableRow.Duration;
	if ( start = Date ( 1, 1, 1 ) ) then
		return;
	elsif ( duration = 0 ) then
		TableRow.DateEnd = undefined;
	else
		TableRow.DateEnd = AddMonth ( start, duration );
	endif; 
	
EndProcedure 

&AtClient
Procedure calcDuration ()
	
	emptyDate = Date ( 1, 1, 1 );
	start = TableRow.DateStart;
	end = TableRow.DateEnd;
	if ( start = emptyDate
		or end = emptyDate ) then
		TableRow.Duration = 0;
	else
		TableRow.Duration = toMonths ( end ) - toMonths ( start );
	endif; 
	
EndProcedure 

&AtClient
Function toMonths ( Date )
	
	return 12 * Year ( Date ) + Month ( Date );
	
EndFunction 

&AtClient
Procedure DurationOnChange ( Item )
	
	сalcDateEnd ();
	
EndProcedure

&AtClient
Procedure DateEndOnChange ( Item )
	
	calcDuration ();
	
EndProcedure

// *****************************************
// *********** Table Additions

&AtClient
Procedure ObjectAdditionsOnActivateRow ( Item )
	
	AdditionsRow = Item.CurrentData;
	
EndProcedure

&AtClient
Procedure ObjectAdditionsOnStartEdit ( Item, NewRow, Clone )
	
	if ( NewRow and not Clone ) then
		initAddition ();
	endif; 
	
EndProcedure

&AtClient
Procedure initAddition ()
	
	AdditionsRow.Currency = Currency;
	
EndProcedure
